# AddFabricationInformationForRevitElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SteelElementProperties..::..AddFabricationInformationForRevitElements Method
SteelElementProperties Class See Also
---
This method adds fabrication information to the given elements.
**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static IList<ElementId> AddFabricationInformationForRevitElements(
	Document aDoc,
	IList<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Shared Function AddFabricationInformationForRevitElements ( _
	aDoc As Document, _
	elementIds As IList(Of ElementId) _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
static IList<ElementId^>^ AddFabricationInformationForRevitElements(
	Document^ aDoc,
	IList<ElementId^>^ elementIds
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document Document containing the given elements ids.
elementIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> Ids of the elements to which we want to add fabrication information.
# ### Return Value
Ids of the elements for which we couldn't add fabrication information.
# Remarks
You can add fabrication information to connections, beams, columns, braces, walls, floors and foundations.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace